[
  {
    "company": "Shopify",
    "jobTitle": "Senior Software Engineer",
    "startDate": "2022-05-01",
    "endDate": null,
    "url": "https://shopify.com",
    "description": [
      "Senior fullstack engineer in growth engineering on the activation team, focused on helping merchants succeed in their early journey. Build tools for accelerating merchant conversion from other platforms and contribute to AI-powered features that enhance the early merchant experience. Previously worked on retail growth initiatives.",
      "Design and maintain scalable web applications using Ruby on Rails for backend services and React for frontend interfaces, with fullstack TypeScript applications. Work on GraphQL APIs handling millions of requests, designing schemas for backward compatibility and evolution.",
      "Build distributed systems and cloud infrastructure serving millions of merchants. On-call engineer managing production incidents and reliability. Contribute to security and OAuth initiatives as part of platform work. Instrument systems with OpenTelemetry for production observability."
    ],
    "skills": [
      "rails",
      "react",
      "typescript",
      "ruby",
      "javascript",
      "postgresql",
      "mysql",
      "kafka",
      "graphql",
      "distributedSystems",
      "opentelemetry",
      "observability",
      "oauth",
      "security",
      "onCall"
    ]
  },
  {
    "company": "Borrowell",
    "jobTitle": "Senior Frontend Developer",
    "startDate": "2020-03-01",
    "endDate": "2022-05-01",
    "url": "https://borrowell.com",
    "description": [
      "Senior frontend engineer at Borrowell, a Canadian FinTech with over 1.5 million users. Started as sole frontend engineer and grew the team to 5 engineers while serving as tech lead for growth platforms, establishing patterns and best practices for the frontend organization.",
      "Built and maintained the growth marketing platform using GatsbyJS (React) as a static site generator for SEO-optimized web applications, and worked with React Native for the mobile team. Worked with GraphQL and Contentful for scalable content management.",
      "Scaled the frontend infrastructure and mentored engineers on component architecture, state management, and performance optimization."
    ],
    "skills": [
      "react",
      "reactNative",
      "graphql",
      "nodejs",
      "gatsby",
      "contentful",
      "azure"
    ]
  },
  {
    "company": "The Fields Institute at The University of Toronto",
    "jobTitle": "Web Application Developer (1yr contract)",
    "startDate": "2019-03-01",
    "endDate": "2020-03-01",
    "url": "https://fields.utoronto.ca",
    "description": [
      "In-house web application developer for the Fields Institute, a world-renowned mathematical research institute at the University of Toronto.",
      "Developed modern React and Redux frontends to interface with legacy backend APIs, building tools for researchers and administrators. Worked across the full stack with Node.js, PostgreSQL, and SQLite databases."
    ],
    "skills": ["react", "redux", "nodejs", "postgres", "sqlite", "docker"]
  },
  {
    "company": "TELUS Mobility",
    "jobTitle": "Developer Analyst",
    "startDate": "2015-10-01",
    "endDate": "2018-04-01",
    "url": "https://telus.com",
    "description": [
      "Developer Analyst on the retail support team at TELUS Mobility, creating and maintaining internal employee portals and customer-facing web applications.",
      "Built web applications using JavaScript, PHP, and jQuery, integrated with MariaDB and MySQL databases. Leveraged CMS platforms for content management and used Sass for scalable styling.",
      "Delivered tools that improved operational efficiency for retail staff across TELUS locations."
    ],
    "skills": ["javascript", "php", "jquery", "mariadb", "mysql", "cms", "sass"]
  }
]
